{
  "projects": {
    "aa_space": {
      "description": "Integrative educational social project to support people in recovery, with a closed forum and chat system (Angular + backend)."
    },
    "certificados-wesley": {
      "description": "My certificates repository."
    },
    "experimenta-ai---soneca": {
      "description": "Full management system for snack bars with Clean Architecture, Java 17, modular Spring Boot, Angular 17+, and MySQL."
    },
    "first-angular-app": {
      "description": "Task management system in Angular 19 with standalone components, services, reactive forms, routing, and local persistence."
    },
    "investment_calculator": {
      "description": "Investment calculator in Angular 18 with compound interest projections, Signals, and year-by-year results."
    },
    "lobby-pedidos": {
      "description": "Order lobby migrated from React to Angular and integrated with a snack bar's core production app (marked for deletion)."
    },
    "lol-matchmaking-fazenda": {
      "description": "End-to-end scalable system for queue, matchmaking, draft, player management, and leaderboard with automations for Discord and LoL."
    },
    "mercearia-r-v": {
      "description": "Complete cash register, inventory, and sales system with reports and advanced features, developed as a service swap."
    },
    "obaid-with-bro": {
      "description": "Obaid 2.0 — AI chatbot for pranks, built to practice AI API integration using Spring Boot and Angular."
    },
    "pintarapp": {
      "description": "App to import and color SVGs on a tablet; ongoing project worked on when time allows."
    },
    "traffic_manager": {
      "description": "Real-time monitoring dashboard in Angular 18 with standalone components, Signals, and a ticketing system."
    },
    "wmakeouthill": {
      "description": "Repository containing my GitHub profile README."
    },
    "wmakeouthill.github.io": {
      "description": "Full-stack portfolio (Java 17 + Spring Boot + Angular 20) with AI chat; backend fetches content dynamically from GitHub; deployed on GitHub Pages and Google Cloud Run."
    },
    "planning_poker": {
      "description": "Full-Stack Web Application for Agile Estimation with Planning Poker (2 Voting Modes) and Notion-Style Collaborative Boards. Java 21 + Spring Boot  Angular 21 + TypeScript"
    },
    "regua_maxima_app": {
      "description": "Full-Stack Portfolio Application for Barbershop Management, built with Java 17 + Spring Boot and Angular 20 + Ionic + Capacitor. Features include a backend with JWT authentication, REST API, and geolocation, and a hybrid mobile frontend offering appointment scheduling, customer reviews, and barber–barbershop association."
    },
    "teleprompter_stealth_mode": {
      "description": "Electron desktop application for invisible and discreet teleprompter, ideal for online meetings, OBS Studio recordings, and live presentations. Supports Markdown, configurable auto-scroll, adjustable transparency, and multiple screens."
    },
    "desafio_fullstack": {
      "description": "Fullstack web application for automatic email classification using AI. Angular 20+ frontend with Signals, FastAPI backend, support for OpenAI GPT and Google Gemini. Interactive chat interface with file upload (.txt, .pdf, .eml, .msg, .mbox)."
    },
    "chrome_extensao_skip_video": {
      "description": "High-performance extension for automating skip of short videos to prevent automatic looping (Shorts/Reels/TikTok), developed with pure JavaScript, Manifest V3, event-driven architecture, and zero polling."
    },
    "experimenta_ai_soneca_delivery": {
      "description": "Complete delivery and real-time tracking system developed with Clean Architecture, Java 17, modular Spring Boot, Angular 17+, Google Maps API, and MySQL."
    },
    "glm-4.7-down-config-pc-fraco": {
      "description": "Automated scripts to install and configure GLM-4.7 AI model on low-end PCs. Supports multiple quantizations (Q2-Q5), CPU/GPU offloading, and cross-platform setup (Windows/Linux/Mac). Optimized for limited hardware resources."
    }
  },
  "certs": {
    "Acelere o Desenvolvimento Backend com Java e SpringBoot.pdf": {
      "title": "Accelerate Backend Development with Java and Spring Boot"
    },
    "Diploma - Bacharel em Direito.pdf": {
      "title": "Bachelor of Law Diploma"
    },
    "Feedback - A arte de dar e receber feedbacks mais efetivos.pdf": {
      "title": "Feedback: The Art of Giving and Receiving More Effective Feedback"
    },
    "Infraestrutura e Plataforma como Servico (Pos-graduacao).pdf": {
      "title": "Infrastructure and Platform as a Service (Postgraduate)"
    },
    "Qualidade do Código Fonte (Clean Code).pdf": {
      "title": "Source Code Quality (Clean Code)"
    },
    "Wesley de Carvalho Augusto Correia - Resume.pdf": {
      "title": "Resume (English)"
    },
    "Git e Github FULL CYCLE 4.0.pdf": {
      "title": "Git and Github FULL CYCLE 4.0"
    },
    "SOLID na prática - Princípios e aplicações em design de software - FULLCYCLE.pdf": {
      "title": "SOLID in Practice - Principles and Applications in Software Design - FULLCYCLE"
    },
    "Prevenção à lavagem de dinheiro, financiamento ao terrorismo e ao financiamento da proliferação de armas de destruição em massa.pdf": {
      "title": "Prevention of Money Laundering, Terrorism Financing, and Financing of the Proliferation of Weapons of Mass Destruction"
    },
    "Treinamento anti corrupção.pdf": {
      "title": "Anti-Corruption Training"
    },
    "Treinamento sobre código de ética e Conduta Profissional.pdf": {
      "title": "Training on Code of Ethics and Professional Conduct"
    },
    "Docker na Prática - FULLCYCLE.pdf": {
      "title": "Docker in Practice - FULLCYCLE"
    },
    "Front-End com HTML, CSS, JavaScript e Angular.pdf": {
      "title": "Front-End with HTML, CSS, JavaScript and Angular"
    },
    "Docker para desenvolvimento - FULL CYCLE 4.0.pdf": {
      "title": "Docker for Development - FULL CYCLE 4.0"
    },
    "Agilidade e TDD - um dia no desenvolvimento de software.pdf": {
      "title": "Agility and TDD - A Day in Software Development"
    }
  }
}